{"weightsManifest": [{"weights": [{"name": "conv2d_10/kernel", "dtype": "float32", "shape": [5, 5, 32, 32]}, {"name": "conv2d_10/bias", "dtype": "float32", "shape": [32]}], "paths": ["group1-shard1of1"]}, {"weights": [{"name": "conv2d_11/kernel", "dtype": "float32", "shape": [3, 3, 32, 64]}, {"name": "conv2d_11/bias", "dtype": "float32", "shape": [64]}], "paths": ["group2-shard1of1"]}, {"weights": [{"name": "conv2d_12/kernel", "dtype": "float32", "shape": [3, 3, 64, 64]}, {"name": "conv2d_12/bias", "dtype": "float32", "shape": [64]}], "paths": ["group3-shard1of1"]}, {"weights": [{"name": "conv2d_9/kernel", "dtype": "float32", "shape": [5, 5, 1, 32]}, {"name": "conv2d_9/bias", "dtype": "float32", "shape": [32]}], "paths": ["group4-shard1of1"]}, {"weights": [{"name": "dense_5/kernel", "dtype": "float32", "shape": [3136, 256]}, {"name": "dense_5/bias", "dtype": "float32", "shape": [256]}], "paths": ["group5-shard1of1"]}, {"weights": [{"name": "dense_6/kernel", "dtype": "float32", "shape": [256, 10]}, {"name": "dense_6/bias", "dtype": "float32", "shape": [10]}], "paths": ["group6-shard1of1"]}], "modelTopology": {"keras_version": "2.1.6", "model_config": {"config": [{"config": {"activation": "relu", "filters": 32, "padding": "same", "activity_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "use_bias": true, "dtype": "float32", "batch_input_shape": [null, 28, 28, 1], "name": "conv2d_9", "dilation_rate": [1, 1], "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [5, 5], "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "filters": 32, "padding": "same", "activity_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_size": [5, 5], "name": "conv2d_10", "dilation_rate": [1, 1], "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_5", "pool_size": [2, 2], "padding": "valid", "trainable": true, "strides": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_7", "rate": 0.25, "noise_shape": null, "trainable": true, "seed": null}, "class_name": "Dropout"}, {"config": {"activation": "relu", "filters": 64, "padding": "same", "activity_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_size": [3, 3], "name": "conv2d_11", "dilation_rate": [1, 1], "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "filters": 64, "padding": "same", "activity_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_size": [3, 3], "name": "conv2d_12", "dilation_rate": [1, 1], "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_6", "pool_size": [2, 2], "padding": "valid", "trainable": true, "strides": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_8", "rate": 0.25, "noise_shape": null, "trainable": true, "seed": null}, "class_name": "Dropout"}, {"config": {"name": "flatten_3", "trainable": true, "data_format": "channels_last"}, "class_name": "Flatten"}, {"config": {"activation": "relu", "units": 256, "use_bias": true, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_5", "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"name": "dropout_9", "rate": 0.5, "noise_shape": null, "trainable": true, "seed": null}, "class_name": "Dropout"}, {"config": {"activation": "softmax", "units": 10, "use_bias": true, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_6", "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential"}, "backend": "tensorflow", "training_config": {"loss_weights": null, "optimizer_config": {"config": {"lr": 0.0010000000474974513, "rho": 0.8999999761581421, "epsilon": 1e-08, "decay": 0.0}, "class_name": "RMSprop"}, "metrics": ["accuracy"], "sample_weight_mode": null, "loss": "categorical_crossentropy"}}}