{"weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"name": "conv2d_1/kernel", "shape": [5, 5, 1, 32], "dtype": "float32"}, {"name": "conv2d_1/bias", "shape": [32], "dtype": "float32"}]}, {"paths": ["group2-shard1of1"], "weights": [{"name": "conv2d_2/kernel", "shape": [5, 5, 32, 32], "dtype": "float32"}, {"name": "conv2d_2/bias", "shape": [32], "dtype": "float32"}]}, {"paths": ["group3-shard1of1"], "weights": [{"name": "conv2d_3/kernel", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "conv2d_3/bias", "shape": [64], "dtype": "float32"}]}, {"paths": ["group4-shard1of1"], "weights": [{"name": "conv2d_4/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_4/bias", "shape": [64], "dtype": "float32"}]}, {"paths": ["group5-shard1of1"], "weights": [{"name": "dense_1/kernel", "shape": [3136, 256], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [256], "dtype": "float32"}]}, {"paths": ["group6-shard1of1"], "weights": [{"name": "dense_2/kernel", "shape": [256, 10], "dtype": "float32"}, {"name": "dense_2/bias", "shape": [10], "dtype": "float32"}]}], "modelTopology": {"keras_version": "2.1.4", "backend": "tensorflow", "model_config": {"config": [{"config": {"kernel_size": [5, 5], "kernel_constraint": null, "data_format": "channels_last", "trainable": true, "bias_constraint": null, "use_bias": true, "name": "conv2d_1", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1], "padding": "same", "dtype": "float32", "batch_input_shape": [null, 28, 28, 1], "filters": 32, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"kernel_size": [5, 5], "kernel_constraint": null, "data_format": "channels_last", "trainable": true, "bias_constraint": null, "activity_regularizer": null, "name": "conv2d_2", "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "padding": "same", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "filters": 32, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "trainable": true, "strides": [2, 2], "padding": "valid", "name": "max_pooling2d_1", "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "trainable": true, "noise_shape": null, "seed": null, "rate": 0.25}, "class_name": "Dropout"}, {"config": {"kernel_size": [3, 3], "kernel_constraint": null, "data_format": "channels_last", "trainable": true, "bias_constraint": null, "activity_regularizer": null, "name": "conv2d_3", "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "padding": "same", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "filters": 64, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"kernel_size": [3, 3], "kernel_constraint": null, "data_format": "channels_last", "trainable": true, "bias_constraint": null, "activity_regularizer": null, "name": "conv2d_4", "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "padding": "same", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "filters": 64, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "trainable": true, "strides": [2, 2], "padding": "valid", "name": "max_pooling2d_2", "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_2", "trainable": true, "noise_shape": null, "seed": null, "rate": 0.25}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"kernel_constraint": null, "trainable": true, "bias_constraint": null, "activity_regularizer": null, "name": "dense_1", "units": 256, "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu"}, "class_name": "Dense"}, {"config": {"name": "dropout_3", "trainable": true, "noise_shape": null, "seed": null, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"kernel_constraint": null, "trainable": true, "bias_constraint": null, "activity_regularizer": null, "name": "dense_2", "units": 10, "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "softmax"}, "class_name": "Dense"}], "class_name": "Sequential"}, "training_config": {"metrics": ["accuracy"], "loss": "categorical_crossentropy", "loss_weights": null, "optimizer_config": {"config": {"rho": 0.8999999761581421, "epsilon": 1e-08, "lr": 6.25000029685907e-05, "decay": 0.0}, "class_name": "RMSprop"}, "sample_weight_mode": null}}}